tg-bot/ШаблонБота/src/InformationRegisters/ТекущиеПозицииМенюУчетныхЗаписей/ТекущиеПозицииМенюУчетныхЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеПозицииМенюУчетныхЗаписей</name>
  <resources>
    <name>ПозицияМеню</name>
    <type>
      <types>EnumRef.ПозицииМеню</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

tg-bot/ШаблонБота/src/Enums/ПозицииМеню/ПозицииМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПозицииМеню</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
</mdclass:Enum>

tg-bot/ШаблонБота/src/InformationRegisters/ТекущиеПозицииМенюУчетныхЗаписей/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура УстановитьПозициюМеню(УчетнаяЗапись, ПозицияМеню) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ПозицияМеню = ПозицияМеню;
	Запись.Записать();
	
КонецПроцедуры

Функция ТекущаяПозицияМеню(УчетнаяЗапись) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТекущиеПозицииМенюУчетныхЗаписей.ПозицияМеню
		|ИЗ
		|	РегистрСведений.ТекущиеПозицииМенюУчетныхЗаписей КАК ТекущиеПозицииМенюУчетныхЗаписей
		|ГДЕ
		|	ТекущиеПозицииМенюУчетныхЗаписей.УчетнаяЗапись = &УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПозицияМеню;
	КонецЕсли;
	
	Возврат Перечисления.ПозицииМеню.Старт;
	
КонецФункции

#КонецОбласти
